УТ.УчетЗадач/src/InformationRegisters/cbr_ИсполнителиЗадач/cbr_ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ИсполнителиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.cbr_Роли</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.cbr_ГруппыДоступаКЗадачам</types>
    </type>
  </resources>
  <resources>
    <name>ЗадачаВзята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/cbr_ПодпискаДляТриггера/cbr_ПодпискаДляТриггера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>cbr_ПодпискаДляТриггера</name>
  <enumValues>
    <name>ПроведениеДокументаЗадача</name>
  </enumValues>
  <enumValues>
    <name>ПриСозданииНаСервереФормыЗадачи</name>
  </enumValues>
  <enumValues>
    <name>КнопкаЗакрытияЗадачи</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаВопросПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВопросаПоЗадаче</name>
  </enumValues>
  <enumValues>
    <name>РегламентноеЗадание</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаДедлайнаНаСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДедлайна</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаОценкиНаСогласование</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОценки</name>
  </enumValues>
  <enumValues>
    <name>КнопкаВзятьЗадачу</name>
  </enumValues>
  <enumValues>
    <name>КнопкаВзятьЗадачуСебе</name>
  </enumValues>
  <enumValues>
    <name>ПослеЗаписиНаСервереФормаЗадачи</name>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Documents/cbr_Задача/cbr_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.cbr_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.cbr_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетКонтроляПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.cbr_МеткиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.cbr_ПричиныЗакрытияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.cbr_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ.УчетЗадач/src/Catalogs/cbr_ГруппыДоступаКЗадачам/cbr_ГруппыДоступаКЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ГруппыДоступаКЗадачам</name>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.УчетЗадач/src/CommonForms/cbr_ФормаСпискаВопросовПоЗадаче/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОсновнаяЗадача = Неопределено;
	Если Параметры.Свойство("ОсновнаяЗадача", ОсновнаяЗадача) Тогда
		Задача = ОсновнаяЗадача;
		СписокДоступныхАдресатов = АдресатыВыбраннойЗадачи();

		Для Каждого АдресатСписка Из СписокДоступныхАдресатов Цикл
			Элементы.Адресат.СписокВыбора.Добавить(АдресатСписка);
		КонецЦикла;

		Постановщик = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОсновнаяЗадача, "Постановщик");

		Если ТипЗнч(Постановщик) = Тип("СправочникСсылка.Пользователи") Тогда
			Адресат = Постановщик;
		Иначе
			ОсновнойМенеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "ГлавныйМенеджер");
			Адресат = ОсновнойМенеджер;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ЗадачаПриИзменении(Элемент)
	СписокДоступныхАдресатов = АдресатыВыбраннойЗадачи();

	Для Каждого АдресатСписка Из СписокДоступныхАдресатов Цикл
		Элементы.Адресат.СписокВыбора.Добавить(АдресатСписка);
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтправитьВопрос(Команда)
	Отказ = Ложь;

	Если Не ЗначениеЗаполнено(Задача) Тогда
		Отказ = Истина;

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбрана задача";
		Сообщение.Поле = "Задача";
		Сообщение.Сообщить();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Адресат) Тогда
		Отказ = Истина;

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не выбран адресат";
		Сообщение.Поле = "Адресат";
		Сообщение.Сообщить();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекстНовогоВопроса) Тогда
		Отказ = Истина;

		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Введите текст вопроса";
		Сообщение.Поле = "ТекстНовогоВопроса";
		Сообщение.Сообщить();
	КонецЕсли;

	Если Не Отказ Тогда
		ОтправитьВопросНаСервере();
		Подписка = ПредопределенноеЗначение(
		"Перечисление.cbr_ПодпискаДляТриггера.СозданиеВопросаПоЗадаче");
		cbr_ОбработкаТриггеровВызовСервера.ВызовТриггера(Подписка, Задача);
		Закрыть();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция АдресатыВыбраннойЗадачи()
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	cbr_ЗадачаНаблюдатели.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ вт_НесгруппированныеПользователи
	|ИЗ
	|	Документ.cbr_Задача.Наблюдатели КАК cbr_ЗадачаНаблюдатели
	|ГДЕ
	|	cbr_ЗадачаНаблюдатели.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	cbr_ЗадачаНаблюдатели.Пользователь
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель
	|ИЗ
	|	РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Ссылка
	|	И Исполнитель ССЫЛКА Справочник.Пользователи) КАК cbr_ИсполнителиЗадачСрезПоследних
	|СГРУППИРОВАТЬ ПО
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	cbr_Задача.Автор
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	cbr_Задача.Автор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|	КОНЕЦ
	|ИЗ
	|	Документ.cbr_Задача КАК cbr_Задача
	|ГДЕ
	|	cbr_Задача.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА cbr_Задача.Постановщик ССЫЛКА Справочник.Пользователи
	|			ТОГДА cbr_Задача.Постановщик
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	cbr_ГруппыДоступаКЗадачамПользователи.Пользователь
	|ИЗ
	|	РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(, Задача = &Ссылка
	|	И Исполнитель ССЫЛКА Справочник.cbr_ГруппыДоступаКЗадачам) КАК cbr_ИсполнителиЗадачСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.cbr_ГруппыДоступаКЗадачам.Пользователи КАК cbr_ГруппыДоступаКЗадачамПользователи
	|		ПО cbr_ГруппыДоступаКЗадачамПользователи.Пользователь = cbr_ИсполнителиЗадачСрезПоследних.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_НесгруппированныеПользователи.Пользователь
	|ИЗ
	|	вт_НесгруппированныеПользователи КАК вт_НесгруппированныеПользователи
	|СГРУППИРОВАТЬ ПО
	|	вт_НесгруппированныеПользователи.Пользователь";

	Запрос.УстановитьПараметр("Ссылка", Задача);

	Выборка =  Запрос.Выполнить().Выбрать();

	МассивКандидатов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Пользователь) И Выборка.Пользователь
			<> Пользователи.АвторизованныйПользователь() Тогда
			МассивКандидатов.Добавить(Выборка.Пользователь);
		КонецЕсли;
	КонецЦикла;

	ОсновнойМенеджер = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "ГлавныйМенеджер");
	Если ОсновнойМенеджер <> Справочники.Пользователи.ПустаяСсылка() Тогда
		МассивКандидатов.Добавить(ОсновнойМенеджер);
	КонецЕсли;

	Возврат МассивКандидатов;
КонецФункции

&НаСервере
Процедура ОтправитьВопросНаСервере()
	cbr_ДвиженияПоРегистрам.ДвижениеВопросыПоЗадачам(Задача, Адресат, ТекстНовогоВопроса);
КонецПроцедуры
#КонецОбласти
